public class Menus {
    public static void MyMenu() {
        System.out.println("1. Работа с квартирами.");
        System.out.println("2. Работа с коммерческими помещениями.");
        System.out.println("3. Удалить все из списков.");
        System.out.println("4. Вывести сгруппированные списки.");
        System.out.println("5. Выйти из приложения.");
    }
    public static void MenuFlat() {
        System.out.println("1. Добавить квартиру в список для аренды.");
        System.out.println("2. Удалить квартиру из списка для аренды.");
        System.out.println("3. Отсортировать квартиры по цене (по возрастанию) и вывести.");
        System.out.println("4. Отсортировать квартиры по цене (по убыванию) и вывести.");
        System.out.println("5. Сгруппировать квартиры по станции метро и вывести.");
        System.out.println("6. Выбрать лучшую квартиру по оценке и вывести.");
        System.out.println("7. Вывести изначальный список квартир для аренды.");
    }
    public static void MenuCommercialPremises() {
        System.out.println("1. Добавить коммерческое помещение в список для аренды.");
        System.out.println("2. Удалить коммерческое помещение из списка для аренды.");
        System.out.println("3. Отсортировать коммерческие помещения по цене (по возрастанию) и вывести.");
        System.out.println("4. Отсортировать коммерческие помещения по цене (по убыванию) и вывести.");
        System.out.println("5. Сгруппировать коммерческие помещения по станции метро и вывести.");
        System.out.println("6. Выбрать лучшее коммерческое помещение по оценке и вывести.");
        System.out.println("7. Вывести изначальный список коммерческих помещений для аренды.");
    }
}
